siege-result/read-without-cache-flush-c250-d1-t130-result.txt
** SIEGE 4.1.0
** Preparing 250 concurrent users for battle.
The server is now under siege...
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[...]
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[...]
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] unable to write to socket sock.c:733: Broken pipe
[error] unable to write to socket sock.c:733: Broken pipe

Lifting the server siege...
Transactions:		       33521 hits
Availability:		       99.39 %
Elapsed time:		      129.91 secs
Data transferred:	        0.63 MB
Response time:		        0.46 secs
Transaction rate:	      258.03 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		      118.88
Successful transactions:       33521
Failed transactions:	         207
Longest transaction:	        3.21
Shortest transaction:	        0.01