siege-result/write-b-c100-t15s-result.txt
** SIEGE 4.1.0
** Preparing 100 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1378 hits
Availability:		      100.00 %
Elapsed time:		       14.64 secs
Data transferred:	        0.03 MB
Response time:		        1.03 secs
Transaction rate:	       94.13 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       96.90
Successful transactions:        1378
Failed transactions:	           0
Longest transaction:	        1.72
Shortest transaction:	        0.04